{
  "main": {
    "name": "Muhamad Sahid",
    "occupation": " Full Stack Software Developer",
    "description": " currently freelancing",
    "employer": " ",
    "jobDescription": "brainstorm ideas, design wireframe, and slap my keyboard until everything works",
    "image": "profile_pic.jpg",
    "bio": "I am an athlete at heart, with an entrepreneurial spirit, a knack for online security, and a passion for coding. Born in a south west sydeny, alongside my many ongoing projects. I love to create and tend to keep a few too many projects on the go at a time. Outside of work I am an avid thrill seeker, hiking and seeking new goals to accomplish. I love to travel and lead a fairly nomadic lifestyle. As show are some client work i've done in my early stages as a programmer.",
    "contactmessage": "Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "mas152q@gmail.com",
    "address": {
      "city": "Sydney",
      "state": "New South Wales",
      "postCode": "2170"
    },
    "website": "",
    "resumedownload": "https://drive.google.com/uc?export=pdf&id=1JZ_9_koC-W0jVg39lGh8Jd0hwJzv8kqn",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/muhamad-sahid-791981113/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "stack-overflow",
        "url": "https://stackoverflow.com/",
        "className": "fa fa-stack-overflow"
      },
      {
        "name": "github",
        "url": "https://github.com/s3793758",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I'm a tinkerer and am always interested in playing around with new technologies but these are the ones that have really won me over",
    "education": [
      {
        "school": "University of Wollongong",
        "degree": "Bachelors in Infromation Technology",
        "graduated": "Expected April 2022",
        "description": "Here I took my Bachelors degree achieved a much more thorough education. It was here that I discovered my passion for scalable application programming (web and mobile), the security behind computer and application systems."
      },
      {
        "school": "University of Sydney",
        "degree": "Full Stack Developer",
        "graduated": "August 2022",
        "description": "I took place in a virtual learning where every week we would learn and be assest in new concepts on full stack development, with group projects done virtually, such as html,css, jquery,bootstrap, other html frameworks, node,express, javascrip es6, oop, heoku, mongodb, mysql, orm, handlebar, react ."
      },
      {
        "school": "University of jiao tong",
        "degree": "Full Stack Developer",
        "graduated": "2018",
        "description": "I took place in a global summer school intertship with 13 countries, being nomintated team leader in building a weather APi using bootstrap, css, javascript, mysql, placing 3rd place out of 12 teams."
      }
    ],
    "work": [
      {
        "company": "Ohana Dev",
        "title": "Full Stack Developer",
        "years": "October 2021 - Present",
        "description": "Mulitiple clients, in the humaintarian aid sector. Using bootstrap, css, javascript  \n\n ."
      },
      {
        "company": "Ohana Dev",
        "title": "Full Stack Developer - contractor",
        "years": "August - Present",
        "description": "Building an audit application for employees to overview working hours, income and expneisved used , which display summary PDF of selected options. \n\nI was given the ooportunuty to build the whole application, in conducting everything i learned from both degress, insuring stakeholders wireframe designs and working prototype using figma, then creating test version and seeing it deployed live."
      }
    ],
    "skills": [
      {
        "name": "Git",
        "description": "I use Git for all of my projects so far. I have used Git for version control in small teams and have toyed around with contributing to Open Source Projects.",
        "image": "git.jpg"
      },
      {
        "name": "Javascript",
        "description": "Javascript is my first programming language that I started using in university. It is by far the language I am most familiar with in terms of data-structure and algorithm programming.",
        "image": "js.png"
      },
      {
        "name": "React Js",
        "description": "I am fairly new to React and really did not like it at first. It has grown on me though and I will continue to use it going forward. I have built a ReactJS based resume-website template (link below in portfolio) which I used as a starting point for this personal site.",
        "image": "react.jpg"
      },
      {
        "name": "Handlebar JS",
        "description": "I enjoy MeteorJS for it's ease of configuration and its ability to get a full stack prototype up and running quickly. I used MeteorJS in a team for a Startup Programming class in UVIC in conjunction with React to build the MVP for Smirkspace (below in portfolio)",
        "image": "hsjs.jpg"
      },

      {
        "name": "Node JS and Express JS",
        "description": "Node JS is my server-side scripting language of choice. The bulk of my experience with it has been in conjunction with MeteorJS-based projects",
        "image": "noteexpress.png"
      },
      {
        "name": "Bootstrap 4",
        "description": "I use Bootstrap more often than not when designing the layout for my sites. It is the framework I am most familiar with and can therefore design more quickly than with others.",
        "image": "bootstrap.jpg"
      },
      {
        "name": "MongoDB",
        "description": "I have used many different database systems and am better educated and experienced with Relational Databases. However, for many applications, the ease of use of MongoDB better suits my needs and it is much more enjoyable to work with",
        "image": "mongo.jpg"
      },
      {
        "name": "MySQL",
        "description": "I have used many different database systems and am better educated and experienced with Relational Databases. However, for many applications, the ease of use of MongoDB better suits my needs and it is much more enjoyable to work with",
        "image": "mysql.png"
      },
      {
        "name": "Heroku",
        "description": "I use Heroku as my hosting platform for most of my projects because so far they are all unpaid and their free tier is convenient. I also appreciate its integration with Github for such simple deployment.",
        "image": "heroku.jpg"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Voice Of The Ummah",
        "category": "Chairty organisation in nigeria ola discrtid",
        "image": "voiceofummah.png",
        "url": "https://github.com/s3793758/Nigeria-chairty-VoiceOfTheUmmah"
      },
      {
        "title": "Care Out Of Reach",
        "category": "chairty organsiation in uganda ",
        "image": "careoutreach.png",
        "url": "https://github.com/s3793758/Uganda-Chairty-CareOutOfReach"
      },
      {
        "title": "Observent",
        "category": "Auditing Application ensure, incoming, out coming expensive and tracking manpower printing reports",
        "image": "tracker.jpg",
        "url": "https://github.com/"
      },
      {
        "title": "Social Media for hunters",
        "category": "(handlebars) A social media blog on hunting, to provide infromation tips, advice, compeition for new commers but also to store infromation and plan events",
        "image": "hunter.jpg",
        "url": "https://github.com/"
      },
      {
        "title": "FairDinking messager",
        "category": "Messanger group for hunting.",
        "image": "fairdink.jpg",
        "url": "https://github.com/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Muhamad was the right fit to enhance the next step of my organisation. Due to the large following in 4 different countries, having our own website, we're able to ensure we can seperate our social media present but have the website as a step of professionalism. Muhamad has taken me through every step of the way. Thank you Muhamad for your effort knowledge and ensuring we get the best layout.",
        "user": "Mudah  - CEO Voice Of The Ummah"
      }
    ]
  }
}
